PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/serial/sio_serialIO.c
/**
 * @file sio_serialIO.c
 * Support of the LINFlex device of the MPC5643L. The device is configured as UART and fed
 * by DMA. We get a serial RS 232 output channel of high throughput with a minimum of CPU
 * interaction.\n
 *   Input is done by interrupt on a received character. The bandwidth of the input channel
 * is by far lower than the output. This is fine for the normal use case, controlling an
 * application by some input commands, but would become a problem if the intention is to
 * download large data amounts, e.g. for a kind of boot loader.\n
 *   The API is a small set of basic read and write routines, which adopt the conventions
 * of the C standard library so that the C functions for formatted output become usable.
 * Note, the binding to the formatted output functions of the C library is not part of
 * this module.
 * (Formatted input is not possible through C standard functions.)
 *
 * Copyright (C) 2017 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   ldf_initSerialInterface
 *   sio_writeSerial
 *   sio_getChar
 *   sio_getLine
 * Local functions
 *   initPBridge
 *   initDMA
 *   initLINFlex
 *   dmaTransferCompleteInterrupt
 *   linFlexRxInterrupt
 *   registerInterrupts
 */

/*
 * Include files
 */

#include <unistd.h>
#include <stdatomic.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "sio_serialIO.h"
#include "ihw_initMcuCoreHW.h"



/*
 * Defines
 */
 
/** The MPC has two LINFlex devices. This define select the one to be used for serial
    output. Possible is the assignment of either 0 or 1.
      @remark With the TRK-USB-MPC5643L evaluation board the LINFlexD_0 is the preferred
    choice. This device is connected to the host machine through USB and can be used with a
    terminal software on the host without any additional hardware or wiring.
      @remark Setting this define to a value other than 0 has never been tested. */
#define IDX_LINFLEX_D 0

/** The DMA channel to serve the UART with sent data bytes. */
#define DMA_CHN_FOR_SERIAL_OUTPUT   15

/** The interrupt priority for serial output. The interrupt is requested by the DMA when
    all bytes of the last recently initiated transfer are sent.
      @remark The chosen priority needs to be greater or equal than the priority of any
    context, that makes use of the API functions of this module. */
#define INTC_PRIO_IRQ_DMA_FOR_SERIAL_OUTPUT     1

/** The interrupt priority for serial input. The interrupt is requested by the UART when
    another byte has been received.
      @remark The chosen priority needs to be greater or equal than the priority of any
    context, that makes use of the API functions of this module.
      @remark Because of the larger UART buffer applied for serial output, this priority
    should normally be chosen higher than #INTC_PRIO_IRQ_DMA_FOR_SERIAL_OUTPUT. */
#define INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT     2

/** The size of the ring buffer for serial output can be chosen as a power of two of bytes.
      @remark Note, the permitted range of values depends on the reservation of space made
    in the linker control file. */
#define SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO   10

/** The size of the ring buffer for serial input as number of bytes. The maximum capacity
    is one Byte less than the size. */
#define SERIAL_INPUT_RING_BUFFER_SIZE   257

/** The default behavior of terminal programs is to send a CR at the end of a message. By
    configuration, this can also be a pair of CR and LF. This module handles this by
    compile time settings. Each of the two characters can be configured to be understood as
    end of line and the other one can be filtered out. If it is not filtered out then it
    behaves like any ordinary character, it becomes part of the read message that is passed
    on to the application.
      Here we have the end of line character. Should normally be carriage return but may
    also be the linefeed. */
#define SERIAL_INPUT_EOL    '\r'

/** See #SERIAL_INPUT_EOL for an explanation. Here we have a character to be filtered out
    from the input stream. Should normally be linefeed or inactive. Inactive is expressed
    by '\0' (but the zero byte is not filtered). */
#define SERIAL_INPUT_FILTERED_CHAR  '\n'

/** Compute the size of the output ring buffer as number of bytes. */
#define SERIAL_OUTPUT_RING_BUFFER_SIZE  (1u<<(SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO)) 

/** Used for index arithemtics: A mask for the index bits in an integer word. Here for the
    serial output buffer. */
#define SERIAL_OUTPUT_RING_BUFFER_IDX_MASK  (SERIAL_OUTPUT_RING_BUFFER_SIZE-1)


/* The LINFlex device to be used is selected by name depending on the setting of
   #IDX_LINFLEX_D. */
#if IDX_LINFLEX_D == 0
# define LINFLEX LINFLEX0
#elif IDX_LINFLEX_D == 1
# define LINFLEX LINFLEX1
#else
# error Invalid configuration, unknown LINFlex device specified
#endif


/*
 * Local type definitions
 */
 
 
/*
 * Local prototypes
 */
 
 
/*
 * Data definitions
 */
 
/** This development support variable counts the number of DMA transfers intiated since
    power-up, to do the serial output */
volatile unsigned long sio_serialOutNoDMATransfers = 0;

/** The ring buffer for serial output can be memntarily full. In such a case a sent message
    can be truncated (from a few bytes shortend up to entirely lost). This development
    support variable counts the number of message since power-up, which underwent
    trunction.
      @remark Because of the race conditions between serial I/O interrupt an application
    software can not clearly relate a change of \a sio_serialOutNoTruncatedMsgs to a
    particular character or message it gets from the read functions sio_getChar or
    sio_getLine. In particular, it must not try to reset the counter prior to a read
    operation in order to establish such a relation. The application will just know that
    there are garbled messages. */
volatile unsigned long sio_serialOutNoTruncatedMsgs = 0;

/** The ring buffer for serial output can be memntarily full. In such a case a sent message
    can be truncated (from a few bytes shortend up to entirely lost). This development
    support variable counts the number of truncated, lost message characters since
    power-up.
      @remark See \a sio_serialOutNoTruncatedMsgs for race conditions with the input
    functions of this module's API. Just the same holds for \a
    sio_serialOutNoLostMsgBytes. */ 
volatile unsigned long sio_serialOutNoLostMsgBytes = 0;

/** The ring buffer used for the DMA based serial output.
      @remark The size of the buffer is defined here in the C source code but there is a
    strong dependency on the linker control file, too. The log2(sizeOfBuffer) least
    significant bits of the buffer address need to be zero. The buffer address (and thus
    its alignment) is specified in the linker file, which therefore limits the maximum size
    of the buffer. */
static uint8_t SECTION(.heap.dmaRingBuffer) _serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE];

/** The write index into the ring buffer used for serial output. Since we use bytes and
    since the log2(sizeOfBuffer) least significant bits of the buffer address are zero
    the address of the index element is \a _serialOutRingBuf | \a _serialOutRingBufIdxWrM,
    which is equal to \a _serialOutRingBuf + \a _serialOutRingBufIdxWrM.
      @remark The variable is only used modulo SERIAL_OUTPUT_RING_BUFFER_SIZE, i.e. the more
    significant bits don't care (but aren't necessarily zero). This is indicated by the M
    at the end of the name. */
static volatile unsigned int _serialOutRingBufIdxWrM = 0;

/** On-DMA-Complete interrupt and API function sio_writeSerial need to share the
    information, whether a transfer is currently running. The flag is set when all elder
    output had been completed and the client code demand a new output. It is reset when a
    DMA transfer completes and the client code has not demanded a new output meanwhile. */
static volatile bool _serialOutDmaTransferIsRunning = false;

/** The ring buffer used for the interrupt based serial input. No particular section is
    required. Due to the low performance requirements we can use any location and do normal
    address arithmetics. */
static volatile uint8_t _serialInRingBuf[SERIAL_INPUT_RING_BUFFER_SIZE];

/** A pointer to the end of the ring buffer used for serial input. This pointer facilitates
    the cyclic pointer update.
      @remark Note, the pointer points to the last byte in the buffer, not to the first
    address beyond as usually done. */
static volatile const uint8_t * _pEndSerialInRingBuf =
                                    &_serialInRingBuf[SERIAL_INPUT_RING_BUFFER_SIZE-1];

/** The pointer to the next write position in the ring buffer used for serial input. */
static volatile uint8_t * volatile _pWrSerialInRingBuf = &_serialInRingBuf[0];

/** The pointer to the next read position from the ring buffer used for serial input. The
    buffer is considered empty if \a _pWrSerialInRingBuf equals \a _pRdSerialInRingBuf,
    i.e. the buffer can contain up to SERIAL_INPUT_RING_BUFFER_SIZE-1 characters. */
static volatile uint8_t * volatile _pRdSerialInRingBuf = &_serialInRingBuf[0];

/** The number of received but not yet consumed end of line characters. Required for read
    line API function. */
static volatile unsigned int _serialInNoEOL = 0;

/** The number of lost characters due to overfull input ring buffer. */
volatile unsigned long sio_serialInLostBytes = 0; 

#ifdef DEBUG
/** Count all characters received since last reset. This variable is support in DEBUG
    compilation only. */
volatile unsigned long sio_serialInNoRxBytes = 0;
#endif

 
