PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/serial/sio_serialIO.c
/*
 * Function implementation
 */

/**
 * Initialize the DMA device. The chosen channel is set up to write the contents of a
 * cyclic buffer of fixed address and size into the UART.
 *   @remark
 * The DMA initialization is mostly related to the DMA channel in use (which can be
 * considered reserved for this purpose in all reasonable environments). However, this
 * function access some DMA registers, too, that affect all channels (e.g. channel
 * arbitration). This function will require changes, when the module is integrated into an
 * environment, where different DMA channels are applied for different, irrelated purposes.
 */
static void initDMA(void)
{
    /* Check preconditions for use of DMA with modulo source addressing. If this assert
       fires it may point to a inconsistency between the C source code and the linker
       control file, which provides the address of the buffer. */
    assert(((uintptr_t)_serialOutRingBuf & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK) == 0);
    
    /* Initialize write to ring buffer. */
    _serialOutRingBufIdxWrM = 0;
    
    /* Initial load address of source data is the beginning of the ring buffer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR =
                                    (vuint32_t)&_serialOutRingBuf[_serialOutRingBufIdxWrM];
    /* Read 1 byte per transfer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.SSIZE = 0;
    /* After transfer, add 1 to the source address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.SOFF = 1;
    /* After major loop, do not move the source pointer. Next transfer will read from next
       cyclic address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD12_.B.SLAST = 0;
    /* Source modulo feature is applied to implement the ring buffer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.SMOD =
                                                SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO;

    /* Load address of destination is fixed. It is the byte input of the UART's FIFO. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD16_.B.DADDR =
                                                        ((vuint32_t)&LINFLEX.BDRL.R) + 3;
    /* Write 1 byte per transfer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.DSIZE = 0;
    /* After transfer, do not alter the destination address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.DOFF = 0;
    /* After major loop, do not alter the destination address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD24_.B.DLAST_SGA = 0;
    /* Destination modulo feature is not used. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.DMOD = 0;

    /* Transfer 1 byte per minor loop */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.SMLOE = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.DMLOE = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.MLOFF = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.NBYTES = 1;

    /* Initialize the begining and current major loop iteration counts to zero. We will set
       it in the next call of sio_writeSerial. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER_LINKCH = 0;

    /* Do a single transfer; don't repeat, don't link to other channels. 1: Do once, 0:
       Continue by repeating all */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.D_REQ = 1;
    
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.INT_HALF = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.INT_MAJ = 1;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER_E_LINK = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER_E_LINK = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.MAJOR_E_LINK = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.E_SG = 0;
    
    /* 0: No stalling, 3: Stall for 8 cycles after each byte; fast enough for serial com. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BWC = 3;
    
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.START = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.DONE = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.ACTIVE = 0;

    /* ERCA, 0x4: 1: Round robin for channel arbitration, 0: Priority controlled
       EDBG, 0x2: 1: Halt DMA when entering the debugger.
         Note, this setting affects all channels! */
    EDMA.DMACR.R = 0x2;

    /* We use priority controlled channel arbitration. All active channels need to have
       different priorities. The standard configuration is to set the priority to the
       channel number. This is the reset default of the hardware and we are not going to
       change it. The reset default disables preemptability or all channels.
         Note, this configuration affects all channels! */
#if 0
    unsigned int idxChn;
    for(idxChn=0; idxChn<16; ++idxChn)
    {
        /* ECP, 0x80: 1: Channel can be preempted, 0: cannot be preempted
           DPA, 0x40: 0: Channel can preempt, 1: cannot preempt others */
        EDMA.DCHPRI[idxChn].R = idxChn;
    }
#endif

    /* EDMA.DMAERQL.R: Not touched yet, we don't enable the channel yet. This will be done in
       the next use of sio_writeSerial. */
    
    /* Route LINFlex TX DMA request to eDMA channel DMA_CHN_FOR_SERIAL_OUTPUT.
         ENBL, 0x80: Enable channel
         SOURCE, 0x3f: Selection of DMAMUX input. The devices are hardwired to the DMAMUX
       and the index of a specific device can be found in table 18-4, MCU ref. manual, p.
       388. Index 22: LINFlexD_0, Tx, index 24: LINFlexD_1, Tx */
    DMAMUX.CHCONFIG[DMA_CHN_FOR_SERIAL_OUTPUT].R |= (0x80 + 22 + 2*IDX_LINFLEX_D);

} /* End of initDMA */




/**
 * Initialization of the MPC5643L's I/O device LINFlex_0. The device is put into UART mode
 * for serial in-/output.
 *   @param baudRate
 * The Baud rate in Hz. Allow values range from 10 .. 1000000, proven values range from 300
 * till 115200 Hz.
 *   @remark
 * To match the correct Baud rates the code assumes a peripheral clock rate of 120 MHz.
 */
static void initLINFlex(unsigned int baudRate)
{
    /* Avoid over-/underflow down below. */
    if(baudRate < 10)
        baudRate = 10;
    else if(baudRate > 1000000)
        baudRate = 1000000;
    
    /* Please find the UART register description in the MCU ref. manual, section 30.10, p.
       979ff. */

    /* Enter INIT mode. This is a prerequiste to access the other registers.
       INIT, 0x1: 1 init mode, 0 normal operation or sleep
       SLEEP, 0x2: 1 sleep mode, 0: normal operation */
    LINFLEX.LINCR1.R = 0x1;

    /* Wait for acknowledge of the INIT mode. */
    while (0x1000 != (LINFLEX.LINSR.R & 0xf000))
    {}

    /* Configure SIUL. Specify for the affected MCU pins, which function they have. We
       connect the RX and TX ports of the LINFlex_0 device with the MCU pins, that are
       connected to the USB-to-serial chip. The possible connections are (MCU ref. manual,
       table 3-5, p. 95ff):
       LINFlexD_0, TX: PB2
       LINFlexD_0, RX: PB3, PB7
       LINFlexD_1, TX: PD9, PF14
       LINFlexD_1, RX: PB13, PD12, PF15 */

