PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/serial/sio_serialIO.c
    /* Principal register PCR of SIUL:
       SMC: irrelevant, 0x4000
       APC: digital pin use, 0x2000 = 0
       PA, 0xc00: output source select, n means ALTn, n=0 is GPIO
       OBE, 0x200: relevant only for ALTn!=0, better to set =0 otherwise
       IBE: input buffer, relevance unclear, 0x100=0 (off)/1 (on)
       ODE: Open drain, 0x20=0 (push/pull), 1 means OD
       SRC: Slew rate, 0x4=1 (fastest), 0 means slowest
       WPE: "weak pull-up", meaning unclear, 0x2=0 (off)
       WPS: Pull-up/down, irrelevant 0x1=1 (up)/0 (down) */
    if(IDX_LINFLEX_D == 0)
    {
        /* We connect the pair PB2/3, which is connected to the USB to serial converter
           MC9S08JM60CLD on the evaluation board. This permits direct connection to the RS
           232 through a virtual COM port visible on the host machine.
             We choose:
           TX: PA=1=0x400, OBE=0=0, IBE=0=0, ODE=0=0, SRC=1=0x4, WPE=0=0 => 0x404
           RX: PA=0=0, OBE=0=0, IBE=1=0x100 => 0x100 */
        SIU.PCR[18].R = 0x0404;     /* Configure pad PB2, TX, for ALT1: LINFlexD_0, TXD */
        SIU.PCR[19].R = 0x0100;     /* Configure pad PB3 for LINFlexD_0, RXD */
    }
    else
    {
        assert(IDX_LINFLEX_D == 1);
        
        /* We connect to the pair PD9/12, which is connected to the tower extension bus of
           the evaluation board. Using this pin pair requires additional, external wiring.
             We choose:
           TX: PA=2=0x800, OBE=0=0, IBE=0=0, ODE=0=0, SRC=1=0x4, WPE=0=0 => 0x804
           RX: PA=0=0, OBE=0=0, IBE=1=0x100 => 0x100 */
        SIU.PCR[57].R = 0x0804;     /* Configure pad PD9, TX, for ALT2: LINFlexD_1, TXD */
        SIU.PCR[60].R = 0x0100;     /* Configure pad PD12 for LINFlexD_0, RXD */
    }

    /* PSMI: Input select. */
    SIU.PSMI31.B.PADSEL = 0;    /* PSMI[31]=0 connects pin B3 with LINFlexD_0 RX. */

    /* Configure the LINFlex to operate in UART mode
       UART, 0x1: 0 for UART, 1 for LIN
         Note, the NXP samples set the UART bit prior to other bits in the same register in
       order to become able to write the other configuration bits. This has not been
       doubted although such behavior is not documented in the MCU manual, section 30.9. */
    LINFLEX.UARTCR.R = 0x0001;

    /* RDFLRFC, 0x1c00: (no bytes to receive - 1) in buffer mode or read FIFO fill amount
       RFBM: RX buffer/FIFO mode, 0x200, 0 means buffer, 1 FIFO mode
       TFBM: TX buffer/FIFO mode, 0x100, 0 means buffer, 1 FIFO mode
       PCE: Parity enable, 0x4, 0 means off
       WL: Word length, 0x80+0x2, value b01 means data 8 Bit
       RX, TX enable, 0x20 and 0x10, respectively (Can be set after leaving the init mode.) */
    LINFLEX.UARTCR.R = 0x0133; /* TX FIFO mode, RX buffer mode, 8bit data, no parity, Tx
                                    enabled, UART mode stays set */

    /// @todo It's unclear if it is always required to use channel 0 in UART mode.
    LINFLEX.DMATXE.R = 0x1; /* Enable DMA TX channel. */

    /* Configure baudrate:
       fsys is 120 MHz (peripheral clock).
       LFDIV = fsys / (16 * desired baudrate)
       LINIBRR.IBR = integer part of LFDIV
       LINFBRR.FBR = 16 * fractional part of LFDIV (after decimal point)

       for instance:
       LFDIV = 120e6/(16*19200) = 390.625
       LINIBRR.IBR = 390
       LINFBRR.FBR = 16*0.625 = 10 
       
       390:10 19200 bd, 65:2 115200 bd, 58:10 128000 bd, 29:5 256000 bd, 8:2 921600 bd
       
        19200 bd worked well with terminal.exe and putty
       115200 bd worked well with terminal.exe and putty
       128000 bd showed transmission errors with terminal.exe and putty
       256000 bd failed with terminal.exe and putty
       921600 bd failed with terminal.exe (not tried with putty) */
    const unsigned long IBR = 7500000ul / baudRate
                      , FBR = (7500000ul - IBR*baudRate)*16 / baudRate;
    assert((IBR & ~0xffffful) == 0  &&  (FBR & ~0xful) == 0);
    LINFLEX.LINIBRR.B.IBR = IBR;
    LINFLEX.LINFBRR.B.FBR = FBR;

#define USE_FIELD_ALIASES_LINFLEX xxx

    /* LINIER: Interrupt enable. The bits relate to the bits of same name in LINESR (error
       bits), LINSR and UARTSR (both status).
         BOIE: Buffer overrun could be read in handling of DBFIE
         DBFIE: should report FIFO full in reception mode
         DBEIETOIE: Should request new data for TX, UARTSR[TO] needs to be set
         DRIE: Interrupt on byte received, DRF set in UARTSR
         DTIE: Interrupt on byte sent, DTF set in UARTSR */
    LINFLEX.LINIER.B.DRIE = 1;
    
    /* GCR
       STOP: 0 for 1 or 1 for 2 stop bits
       SR: set 1 to reset counters, buffers and FIFO but keep configuration and operation */

    /* Enter normal mode again. */
    /// @todo Why don't we wait as on init?
    LINFLEX.LINCR1.R = 0x0; /* INIT, 0x1: 0, back to normal operation */
    
} /* End of initLINFlex */




/**
 * Interrupt handler for DMA channel DMA_CHN_FOR_SERIAL_OUTPUT.
 *   @remark
 * This interrupt must have a priority higher than any OS schedule relevant interrupt. The
 * application tasks using the serial channel must not become active.
 */
static void dmaTransferCompleteInterrupt(void)
{
    /* Note, most buffer addresses or indexes in this section of the code are understood as
       cylic, i.e. modulo the buffer size. This is indicated by an M as last character of
       the affectzed symbols but not mentioned again in the code comments. */
#define MODULO(bufIdx)    ((bufIdx) & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK)

    /* Interrupt should be raised on transfer done. Reset of the bit by software is however
       not required. */
#define IRQ_MASK    (0x1 << DMA_CHN_FOR_SERIAL_OUTPUT)
    assert(EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.DONE == 1);
    assert((EDMA.DMASERQ.R & IRQ_MASK) == 0);
    assert(_serialOutDmaTransferIsRunning);
    
    /* MCU ref manual is ambiguous in how to reset the interrupt request bit: It says both,
       DMAINTL is a normal read modify write register and writing a 1 would reset the
       corresponding bit while writing a 0 has no effect. Tried out: the latter works
       well (and doesn't generate race conditions with other DMA channels like a
       read-modify-write). */
    EDMA.DMAINTL.R = IRQ_MASK;
    
    /* Check the cyclic address computation feature of the DMA in modulo mode. */
    assert(EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR >= (uintptr_t)&_serialOutRingBuf[0]
           &&  EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR
               < (uintptr_t)&_serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE]
          );

    /* We need to retrigger the DMA transfer if the ring buffer has been written meanwhile
       with new data. */
    const uint32_t noBytesWrittenMeanwhile = 
                        MODULO(_serialOutRingBufIdxWrM - EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR);

    /* Same pointer values is used as empty indication. Therefore it is not possible to
       entirely fill the buffer. Condition "less than" holds. */
    assert(noBytesWrittenMeanwhile < SERIAL_OUTPUT_RING_BUFFER_SIZE);

    if(noBytesWrittenMeanwhile > 0)
    {
        /* Set the number of bytes to transfer by DMA to the UART.
             Note, here we have a problem with the NXP support file MPC5643L.h. The same
           value needs to be written to the two fields CITER and BITER of the Transfer
           Control Words 5 and 7, respectivels. These fields are defined conditionally,
           depending on the channel-to-channel linking bit e_link - they have either
           9 or 15 Bit. This could be mapped by a support file e.g. in form of a union,
           which allows both variants. Unfortunately, MPC5643L.h defines CITER and BITER
           unconditionaly but differently. We use the 15 Bit length and may use MPC5643L.h
           to access BITER but must not use the support file to access CITER. */
        EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER = noBytesWrittenMeanwhile;
        //EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER = noBytesWrittenMeanwhile;
        const uint16_t doff = 0;
        EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.R =
                                            ((noBytesWrittenMeanwhile & 0x7fff) << 16) | doff;

