PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/serial/sio_serialIO.c
        /* Enable the UART to request bytes from the DMA. This initiates a subsequent DMA
           transfer. */
        ++ sio_serialOutNoDMATransfers;
        EDMA.DMASERQ.R = DMA_CHN_FOR_SERIAL_OUTPUT;
    }            
    else
    {
        /* No subsequent DMA transfer is immediately initiated, so the application code
           will need to start one the next time the API function sio_writeSerial is
           called. */
        _serialOutDmaTransferIsRunning = false;
    }
#undef MODULO
} /* End of dmaTransferCompleteInterrupt */



/**
 * Interrupt handler for UART RX event. A received character is read from the UART hadrware
 * and put into our ring buffer if there's space left. Otherwise the character is counted
 * as lost without further remedial action.
 */
static void linFlexRxInterrupt()
{
    /* Get the received byte. */
    /// @todo Record a buffer overrun bit in case the IRQ handler comes too slow
    const unsigned char c = LINFLEX.BDRM.B.DATA4;
    
#ifdef DEBUG
    ++ sio_serialInNoRxBytes;
#endif

    /* To support different terminal characteristics, one character can be configured to
       be silently ignored in the input stream. This shall normally be the linefeed
       character. */
#if SERIAL_INPUT_FILTERED_CHAR != 0
    if(c != SERIAL_INPUT_FILTERED_CHAR)
#endif
    {
        /* Check for buffer full. Compute next write position at the same time. */
        volatile uint8_t * const pWrTmp = _pWrSerialInRingBuf
                       , * const pWrNext = pWrTmp < _pEndSerialInRingBuf? pWrTmp+1
                                                                        : &_serialInRingBuf[0];

        /* Put the byte into our buffer if there's enough room. */
        if(pWrNext != _pRdSerialInRingBuf)
        {
            *pWrTmp = c;
        
            /* Count the received end of line characters. (The variable is decremented on
               consumption of such a character.) */
            if(c == SERIAL_INPUT_EOL)
                ++ _serialInNoEOL;

            /* Update write position into ring buffer. This is at the same time the indication
               of the availablity of the new character to the application API functions. */
            _pWrSerialInRingBuf = pWrNext;
        }
        else    
        {
            /* Buffer overrun, count lost character. */
            ++ sio_serialInLostBytes;
        }
    
        /* Ensure that all relevant memory changes are visible before we leave the
           interrupt. */
        atomic_thread_fence(memory_order_seq_cst);
        
    } /* End if(Character discarded?) */

    /* Acknowlege the interrupt and enable the next one at the same time. */
    assert((LINFLEX.UARTSR.R & 0x4) != 0);
    LINFLEX.UARTSR.R = 0x4;  
    
} /* End of linFlexRxInterrupt */



/**
 * Our locally implemented interrupt handlers are registered at the operating system for
 * serving the required I/O devices (DMA and LINFlex 0 or 1).
 */
static void registerInterrupts(void)
{
/* Interrupt offsets taken from MCU reference manual, p. 936. The DMA interrupts for the
   different channels start with 11, e.g. 26 for DMA channel 15. */
#define IDX_DMA_IRQ         (11+DMA_CHN_FOR_SERIAL_OUTPUT)
#define IDX_LINFLEX_RX_IRQ  (79 + 20*IDX_LINFLEX_D)

    /* Register our IRQ handlers. Priority is chosen low for output DMA since we serve a
       slow data channel, which even has a four Byte queue inside. */
    ihw_installINTCInterruptHandler( &dmaTransferCompleteInterrupt
                                   , /* vectorNum */ IDX_DMA_IRQ
                                   , /* psrPriority */ INTC_PRIO_IRQ_DMA_FOR_SERIAL_OUTPUT
                                   , /* isPreemptable */ true
                                   );
    ihw_installINTCInterruptHandler( &linFlexRxInterrupt
                                   , /* vectorNum */ IDX_LINFLEX_RX_IRQ
                                   , /* psrPriority */ INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT
                                   , /* isPreemptable */ true
                                   );
#undef IDX_DMA_IRQ 
#undef IDX_LINFLEX_RX_IRQ
} /* End of registerInterrupts */



/**
 * Initialize the I/O devices for serial output, in particular, these are the LINFlex
 * device plus a DMA channel to serve it.
 *   @param baudRate
 * The Baud rate of in- and output in Hz. Allow values range from 10 .. 1000000, proven
 * values range from 300 till 115200 Hz.
 *   @remark
 * This function needs to be called at system initialization phase, when all External
 * Interrupts are still suspended.
 */
void ldf_initSerialInterface(unsigned int baudRate)
{
    initLINFlex(baudRate);

    /* Register the interrupt handler for DMA. */
    registerInterrupts();
    
    /* Initialize DMA and connect it to the UART. */
    initDMA();

    /* Empty receive buffer. */
    _pWrSerialInRingBuf =
    _pRdSerialInRingBuf = &_serialInRingBuf[0];
    
} /* End of ldf_initSerialInterface */



/** 
 * Principal API function for data output. A byte string is sent through the serial
 * interface. Actually, the bytes are queued for sending and the function is non-blocking. 
 *   @return
 * The number of queued bytes is returned. Normally, this is the same value as argument \a
 * noBytes. However, the byte sequence can be longer than the currently available space in
 * the send buffer. (Its size is fixed and no reallocation strategy is implemented.) The
 * tranmitted message will be truncated if the return value is less than function argument
 * \a noBytes.
 *   @param msg
 * The byte sequence to send. Note, this may be but is not necessarily a C string with zero
 * terminations. Zero bytes can be send, too.
 *   @param noBytes
 * The number of bytes to send. For a C string, this will mostly be \a strlen(msg).
 */
unsigned int sio_writeSerial(const char *msg, unsigned int noBytes)
{
    uint32_t msr = ihw_enterCriticalSection();
    {
        /* Note, most buffer addresses or indexes in this section of the code are
           understood as cylic, i.e. modulo the buffer size. This is indicated by an M as
           last character of the affectzed symbols but not mentioned again in the code
           comments. */
#define MODULO(bufIdx)    ((bufIdx) & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK)

        /* The current, i.e. next, transfer address of the DMA is the first (cyclic)
           address, which we must not touch when filling the buffer. This is the (current)
           end of the free buffer area. */
        const uint32_t idxEndOfFreeSpaceM =
                                EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR;
        
        /* The cyclic character of the buffer can require one or two copy operations to
           place the message. We compute the concrete index ranges to copy.
             Note the -1: Same index values are used as empty-buffer-indication. Therefore
           it is not possible to entirely fill the buffer. */
        const unsigned int noBytesFree =
                                MODULO(idxEndOfFreeSpaceM - _serialOutRingBufIdxWrM - 1);
         
        /* Avoid buffer overrun by saturation of the user demand and report the number of
           overrun events and the number of lost message characters. */
        if(noBytes > noBytesFree)
        {
            ++ sio_serialOutNoTruncatedMsgs;
            sio_serialOutNoLostMsgBytes += noBytes - noBytesFree;
            noBytes = noBytesFree;
        }
        
        /* How many bytes would fit until we have to wrap? This limits the first copy
           operation. */
        const unsigned int noBytesTillEnd = MODULO(- _serialOutRingBufIdxWrM);
        unsigned int noBytesAtEnd;
        if(noBytes <= noBytesTillEnd)
        {
            /* The message fits into the rest of the linear buffer, no wrapping required. */
            noBytesAtEnd = noBytes;
        }
        else
        {
            /* A portion of the message is placed at the end of the linear buffer and the
               rest of the message at its beginning. */
            noBytesAtEnd = noBytesTillEnd;
        }
               
        /* Always copy the first part of the message to the current end of the linear
           buffer. */
        uint8_t * const pDest = &_serialOutRingBuf[MODULO(_serialOutRingBufIdxWrM)];
        assert(pDest + noBytesAtEnd <= &_serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE]);
        memcpy(pDest, msg, noBytesAtEnd);
        
        /* Copy the second part of the message at the beginning of the linear buffer if
           there is a remainder. */
        if(noBytes > noBytesAtEnd)
        {
            assert(noBytes - noBytesAtEnd < sizeof(_serialOutRingBuf));
            memcpy(&_serialOutRingBuf[0], msg+noBytesAtEnd, noBytes-noBytesAtEnd);
        }           
        
        _serialOutRingBufIdxWrM = _serialOutRingBufIdxWrM + noBytes;

